# PaperPlacement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..PaperPlacement Property
PDFExportOptions Class See Also
---
Paper placement of either center or offset from corner.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public PaperPlacementType PaperPlacement { get; set; }
```

Visual Basic
---
```text
Public Property PaperPlacement As PaperPlacementType
	Get
	Set
```

Visual C++
---
```text
public:
property PaperPlacementType PaperPlacement {
	PaperPlacementType get ();
	void set (PaperPlacementType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace